app/Controllers/ClientsController.php

SELECT *
FROM `clients`
WHERE `telephone` = '0333333333'
 LIMIT 1
SELECT *
FROM `clients`
WHERE `clients`.`id` = 3
---
    public function loginClient()
    {
        $telephone = $this->normalizeTelephone($this->request->getPost('telephone'));
        if (empty($telephone)) {
            return redirect()->back()->with('error', 'Veuillez saisir un numéro de téléphone');
        }

        $client = $this->clientsModel->where('telephone', $telephone)->first();
        if (empty($client)) {
            // create client on the fly
            $this->clientsModel->insert(['telephone' => $telephone, 'credit_retrait' => 0]);
            $id = $this->clientsModel->getInsertID();
            $client = $this->clientsModel->find($id);

SELECT *
FROM `prefixes`
---
    protected function getKnownPrefixes(): array
    {
        $prefixes = $this->prefixesModel->findAll();

SELECT *
FROM `clients`
WHERE `telephone` = '0332222222'
 LIMIT 1
---
    protected function resolveClientByTelephone(string $telephone): ?array
    {
        return $this->clientsModel->where('telephone', $telephone)->first();

INSERT INTO `transactions` (`id_type_operation`, `id_expediteur`, `id_destinataire`, `montant`, `frais`, `frais_retrait_prepaye`) VALUES (2, 8, NULL, 1000, 0, 0)
---
    public function withdraw()
    {
        $client = session()->get('client');
        if (empty($client)) return redirect()->to('/')->with('error', 'Veuillez vous connecter');

        $amount = floatval($this->request->getPost('amount'));
        if ($amount <= 0) return redirect()->back()->with('error', 'Montant invalide');

        $operationId = $this->feeCalculator->getOperationId('retrait');
        $fee = $this->feeCalculator->getFeeByName('retrait', $amount);
        $availableCredit = $this->clientsModel->getWithdrawalCredit((int) $client['id']);
        $paidFromCredit = min($availableCredit, $fee);
        $actualFee = max(0, $fee - $paidFromCredit);

        // Check balance
        $solde = $this->getClientBalance($client['id']);

        if ($solde < ($amount + $actualFee)) {
            return redirect()->back()->with('error', 'Solde insuffisant');
        }

        $db = \Config\Database::connect();
        $db->transStart();

        if ($paidFromCredit > 0) {
            $this->clientsModel->consumeWithdrawalCredit((int) $client['id'], $paidFromCredit);
        }

        $this->transactionsModel->insert([
            'id_type_operation' => $operationId,
            'id_expediteur' => $client['id'],
            'id_destinataire' => null,
            'montant' => $amount,
            'frais' => $actualFee,
            'frais_retrait_prepaye' => 0
        ]);

INSERT INTO `transactions` (`id_type_operation`, `id_expediteur`, `id_destinataire`, `montant`, `frais`, `frais_retrait_prepaye`) VALUES (3, 5, 8, 1000, 50, 50)
---
            //analana an ilay $item['amount'],
            $valeurInsert=$item['amount']-($item['amount']*$Cliep['valeur']/100);

            $this->transactionsModel->insert([
                'id_type_operation' => $operationId,
                'id_expediteur' => $client['id'],
                'id_destinataire' => $item['id'],
                //'montant' => $item['amount'],
                'montant' =>$valeurInsert,
                'frais' => $item['transfer_fee'],
                'frais_retrait_prepaye' => $item['prepaid_withdrawal_fee']
            ]);