app/Controllers/ClientsController.php

    public function loginClient()
    {
        $telephone = $this->request->getPost('telephone');
        if (empty($telephone)) {
            return redirect()->back()->with('error', 'Veuillez saisir un numéro de téléphone');
        }

        $client = $this->clientsModel->where('telephone', $telephone)->first();
        if (empty($client)) {
            // create client on the fly
            $this->clientsModel->insert(['telephone' => $telephone]);
---
INSERT INTO `clients` (`telephone`) VALUES ('331234567')

    public function deposit()
    {
        $client = session()->get('client');
        if (empty($client)) return redirect()->to('/')->with('error', 'Veuillez vous connecter');

        $amount = floatval($this->request->getPost('amount'));
        if ($amount <= 0) return redirect()->back()->with('error', 'Montant invalide');

        // Deposits have type 1 and no fees
        $this->transactionsModel->insert([
            'id_type_operation' => 1,
            'id_expediteur' => $client['id'],
            'id_destinataire' => null,
            'montant' => $amount,
            'frais' => 0
        ]);
---
INSERT INTO `transactions` (`id_type_operation`, `id_expediteur`, `id_destinataire`, `montant`, `frais`) VALUES (1, 3, NULL, 30000, 0)

    public function withdraw()
    {
        $client = session()->get('client');
        if (empty($client)) return redirect()->to('/')->with('error', 'Veuillez vous connecter');

        $amount = floatval($this->request->getPost('amount'));
        if ($amount <= 0) return redirect()->back()->with('error', 'Montant invalide');

        $fee = $this->feeCalculator->getFee(2, $amount);

        // Check balance
        $db = \Config\Database::connect();
        $query = $db->query('SELECT solde FROM v_solde_clients WHERE client_id = ?', [$client['id']]);
        $row = $query->getRowArray();
        $solde = $row ? $row['solde'] : 0;

        if ($solde < ($amount + $fee)) {
            return redirect()->back()->with('error', 'Solde insuffisant');
        }

        $this->transactionsModel->insert([
            'id_type_operation' => 2,
            'id_expediteur' => $client['id'],
            'id_destinataire' => null,
            'montant' => $amount,
            'frais' => $fee
        ]);
---
INSERT INTO `transactions` (`id_type_operation`, `id_expediteur`, `id_destinataire`, `montant`, `frais`) VALUES (1, 2, NULL, 50000, 0)