app/Controllers/OperateurController.php

    public function loginOperateur()
    {
        $mdp=$this->request->getPost('password');
        $Op=$this->operateurModel->where('password', $mdp)->first();
---
SELECT *
FROM `operateur`
WHERE `password` = 'admin'
 LIMIT 1

    public function situationComptes()
    {
        $model = new SituationClientModel();

        $data = [
            'comptes' => $model->paginate(10),
            'pager'   => $model->pager,
        ];
---
SELECT *
FROM `situation_clients`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `situation_clients`