app/Models/ClientsModel.php

        public function getWithdrawalCredit(int $clientId): float
        {
            $row = $this->select('COALESCE(credit_retrait, 0) AS credit_retrait')
                ->where('id', $clientId)
                ->first();
---
SELECT COALESCE(credit_retrait, 0) AS credit_retrait
FROM `clients`
WHERE `id` = 8
 LIMIT 1

        public function addWithdrawalCredit(int $clientId, float $amount): bool
        {
            if ($amount <= 0) {
                return true;
            }

            return $this->builder()
                ->set('credit_retrait', 'COALESCE(credit_retrait, 0) + ' . $this->db->escape($amount), false)
                ->where('id', $clientId)
                ->update();
---
UPDATE `clients` SET `credit_retrait` = COALESCE(credit_retrait, 0) + 50
WHERE `id` = 8

        public function consumeWithdrawalCredit(int $clientId, float $amount): bool
        {
            if ($amount <= 0) {
                return true;
            }

            return $this->builder()
                ->set('credit_retrait', 'CASE WHEN COALESCE(credit_retrait, 0) > ' . $this->db->escape($amount) . ' THEN COALESCE(credit_retrait, 0) - ' . $this->db->escape($amount) . ' ELSE 0 END', false)
                ->where('id', $clientId)
                ->update();
---
UPDATE `clients` SET `credit_retrait` = CASE WHEN COALESCE(credit_retrait, 0) > 50 THEN COALESCE(credit_retrait, 0) - 50 ELSE 0 END
WHERE `id` = 8