app/Models/OperateurModel.php

SELECT *
FROM `gains_retrait`
---
        public function getgainsretrait(){
            return $this->db->table('gains_retrait')//anaran ilay vue
                        ->get()
                        ->getRowArray();

SELECT *
FROM `gains_transfert`
---
        public function getgainstransfert(){
            return $this->db->table('gains_transfert')
                        ->get()
                        ->getRowArray();

SELECT *
FROM `v_gains_interne`
---
        public function getGainsInterne()
        {
            return $this->db->table('v_gains_interne')
                ->get()
                ->getRowArray();

SELECT *
FROM `v_gains_autres_operateurs`
ORDER BY `operateur` ASC
---
        public function getGainsAutresOperateurs()
        {
            return $this->db->table('v_gains_autres_operateurs')
                ->orderBy('operateur', 'ASC')
                ->get()
                ->getResultArray();

SELECT *
FROM `v_compensation_operateurs`
ORDER BY `operateur_nom` ASC
---
        public function getCompensationOperateurs()
        {
            return $this->db->table('v_compensation_operateurs')
                ->orderBy('operateur_nom', 'ASC')
                ->get()
                ->getResultArray();