app/Models/PrefixesModel.php

SELECT `prefixes`.*, `operateurs_partenaires`.`nom` as `operateur_nom`
FROM `prefixes`
LEFT JOIN `operateurs_partenaires` ON `operateurs_partenaires`.`id` = `prefixes`.`id_operateur`
ORDER BY `prefixes`.`prefixe` ASC
---
    public function list_prefixe()
    {
        return $this->db->table('prefixes')
            ->join('operateurs_partenaires', 'operateurs_partenaires.id = prefixes.id_operateur', 'left')
            ->select('prefixes.*, operateurs_partenaires.nom as operateur_nom')
            ->orderBy('prefixes.prefixe', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `operateurs_partenaires`
ORDER BY `nom` ASC
---
    public function getOperateursPartenaires()
    {
        return $this->db->table('operateurs_partenaires')
            ->orderBy('nom', 'ASC')
            ->get()
            ->getResultArray();