app/Models/TransactionsModel.php

SELECT `t`.*, CASE
            WHEN t.id_type_operation = 1 THEN 'Dépôt'
            WHEN t.id_type_operation = 2 THEN 'Retrait'
            WHEN t.id_type_operation = 3 THEN 'Transfert'
            ELSE COALESCE(type_op.nom, 'Opération')
        END AS type_nom
FROM `transactions` `t`
LEFT JOIN `type_operations` `type_op` ON `type_op`.`id` = `t`.`id_type_operation`
WHERE (`t`.`id_expediteur` = 1 OR `t`.`id_destinataire` = 1)
ORDER BY `t`.`date_transaction` DESC
 LIMIT 50
---
    public function getClientHistory(int $clientId, int $limit = 50)
    {
        $ids = $this->operationCatalog->getOperationIds();
        $depotId = (int) ($ids['depot'] ?? 0);
        $withdrawId = (int) ($ids['retrait'] ?? 0);
        $transferId = (int) ($ids['transfert'] ?? 0);

        $builder = $this->db->table($this->table . ' t');
        $builder->select("t.*, CASE
            WHEN t.id_type_operation = {$depotId} THEN 'Dépôt'
            WHEN t.id_type_operation = {$withdrawId} THEN 'Retrait'
            WHEN t.id_type_operation = {$transferId} THEN 'Transfert'
            ELSE COALESCE(type_op.nom, 'Opération')
        END AS type_nom");
        $builder->join('type_operations type_op', 'type_op.id = t.id_type_operation', 'left');
        $builder->where('(t.id_expediteur = '.$this->db->escape($clientId).' OR t.id_destinataire = '.$this->db->escape($clientId).')');
        $builder->orderBy('t.date_transaction', 'DESC');
        $builder->limit($limit);
        return $builder->get()->getResultArray();