app/Models/TransactionsModel.php

SELECT `t`.*, `to`.`nom` AS `type_nom`
FROM `transactions` `t`
LEFT JOIN `type_operations` `to` ON `to`.`id` = `t`.`id_type_operation`
WHERE (`t`.`id_expediteur` = 3 OR `t`.`id_destinataire` = 3)
ORDER BY `t`.`date_transaction` DESC
 LIMIT 50
---
    public function getClientHistory(int $clientId, int $limit = 50)
    {
        $builder = $this->db->table($this->table . ' t');
        $builder->select('t.*, to.nom AS type_nom');
        $builder->join('type_operations to', 'to.id = t.id_type_operation', 'left');
        $builder->where('(t.id_expediteur = '.$this->db->escape($clientId).' OR t.id_destinataire = '.$this->db->escape($clientId).')');
        $builder->orderBy('t.date_transaction', 'DESC');
        $builder->limit($limit);
        return $builder->get()->getResultArray();